import re

path = 'input.txt'

with open(path) as f:
    print(f.read())

with open(path) as f:
    lines = f.readlines()

lines_strip = [line.strip() for line in lines]
#['767:bFX4mJ', '905:U6bUU', '896:i3GJgV', '110:2mjDVetMCu', '631:2', '367:9zgl', '147:tv5RqQa', '149:MB2wTBdh', '541:TGlT1n8Q', '920:wcGEN', '612:6', '856:qpxEqk2', '407:BEWPw0F4ZY', '609:xk', '240:N8kG', '32:y', '990:Ns', '907:O4xbwNqqCD', '573:iYH4iL9FsH', '278:nBSLldkpif', '505:Hz', '542:Bfs4pCpb', '114:3fZnnj4', '255:sFqMS', '719:ho6g3rici', '793:YioZFC3WV', '901:uT', '74:nrRkji4', '482:MA', '17:pfXvTAYBYj', '205:2l761N0xhw', '74:XBcrbgv', '139:V2rmBqmUj8', '447:Bedm', '209:jTzjs1Sg', '464:KkGaYjzFR', '252:uLpQu', '353:E9kq6', '718:KRzMw', '657:oT0MJb', '205:d7Vjvga8A', '735:3Y', '717:pQ', '715:AG', '13:FXG', '306:rwrRSN', '153:E', '158:VcEXtd', '766:vjuB', '989:VEgAg', '438:V', '170:AuamAEa', '617:vFQsN0F', '895935051710483657676643043460']




StrA = "".join(lines_strip)
print(StrA)
## StrA is "abc"

pat = r'[0-9]+'                  #抽出するパターン：数字

num_list = re.findall(pat, StrA)  #数字を抽出してリスト化

l_si_i = [int(s) for s in num_list]
#[767, 4, 905, 6, 896, 3, 110, 2, 631, 2367, 9, 147, 5, 149, 2, 541, 1, 8, 920, 612, 6856, 2407, 0, 4, 609, 240, 8, 32, 990, 907, 4, 573, 4, 9, 278, 505, 542, 4, 114, 3, 4255, 719, 6, 3, 793, 3, 901, 74, 4482, 17, 205, 2, 761, 0, 74, 139, 2, 8447, 209, 1, 464, 252, 353, 9, 6718, 657, 0, 205, 7, 8, 735, 3, 717, 715, 13, 306, 153, 158, 766, 989, 438, 170, 617, 0, 895935051710483657676643043460]

M = l_si_i[-1] #最後尾のM

l_replace = [ i for i in l_si_i if i > 9]#数値以外からも数値を抽出しているため、余分な数値を削除
#[767, 905, 896, 110, 631, 2367, 147, 149, 541, 920, 612, 6856, 2407, 609, 240, 32, 990, 907, 573, 278, 505, 542, 114, 4255, 719, 793, 901, 74, 4482, 17, 205, 761, 74, 139, 8447, 209, 464, 252, 353, 6718, 657, 205, 735, 717, 715, 13, 306, 153, 158, 766, 989, 438, 170, 617, 895935051710483657676643043460]

l_even = [i for i in l_replace if M % i == 0]#Mがiの倍数
#[612, 17, 306, 153, 170, 895935051710483657676643043460]

l_sort = sorted(l_even)#整列化
#[17, 153, 170, 306, 612, 895935051710483657676643043460]

'''
あとは、数値のインデックスをもとに文字列のほうも抽出し、つなげればいい。しかし、正規表現による抽出のさいに、
このinput.txtにしか対応していない方法になってしまっている。汎用的な方法はおもいつかなかった。
'''